# YOLOv5 Modified for Late Fusion (MLPD-style)

nc: 1
depth_multiple: 0.33
width_multiple: 0.25
anchors:
  - [21, 51, 23, 66, 32, 64]       # P1 (/2) - 아주 작은 객체
  - [27, 81, 46, 51, 33, 91]       # P2 (/4) - 작은 객체
  - [31, 113, 44, 89, 38, 114]     # P3 (/8) - 중소형 객체
  - [46, 119, 42, 143, 113, 64]    # P4 (/16) - 중간 객체
  - [51, 155, 64, 145, 60, 195]    # P5 (/32) - 중대형 객체
  - [232, 68, 76, 230, 93, 303]    # P6 (/64) - 매우 큰 객체

# MLPD3 ======================================
backbone:
  [
    [-1, 1, MultiStreamConv, [64, 3, 1]],     # 0 - input stem
    [-1, 1, MultiStreamConv, [64, 3, 2]],     # 1 - P1/2
    [-1, 1, MultiStreamC3, [64]],             # 2
    [-1, 1, MultiStreamConv, [128, 3, 2]],    # 3 - P2/4
    [-1, 2, MultiStreamC3, [128]],            # 4
    [-1, 1, MultiStreamConv, [256, 3, 2]],    # 5 - P3/8
    [-1, 3, MultiStreamC3, [256]],            # 6
    [-1, 1, MultiStreamConv, [512, 3, 2]],    # 7 - P4/16
    [-1, 3, MultiStreamC3, [512]],            # 8
    [-1, 1, MultiStreamConv, [1024, 3, 2]],   # 9 - P5/32
    [-1, 3, MultiStreamC3, [1024]],           # 10
    [-1, 1, Fusion, ['concat', 2]],           # 11
    [-1, 1, Conv, [1024, 1, 1]],              # 12
    [-1, 1, SPPF, [1024, 5]],                 # 13
  ]

head: [
    # Upsample path (P5->P4->P3->P2->P1)
    [-1, 1, Conv, [512, 1, 1]],               # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 15
    [8, 1, Fusion, ['concat', 2]],            # 16
    [[15, 16], 1, Concat, [1]],               # 17
    [-1, 3, C3, [512, False]],                # 18 (P4/16)

    [-1, 1, Conv, [256, 1, 1]],               # 19
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 20
    [6, 1, Fusion, ['concat', 2]],            # 21
    [[20, 21], 1, Concat, [1]],               # 22
    [-1, 3, C3, [256, False]],                # 23 (P3/8)

    [-1, 1, Conv, [128, 1, 1]],               # 24
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 25
    [4, 1, Fusion, ['concat', 2]],            # 26
    [[25, 26], 1, Concat, [1]],               # 27
    [-1, 3, C3, [128, False]],                # 28 (P2/4)

    [-1, 1, Conv, [64, 1, 1]],                # 29
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 30
    [2, 1, Fusion, ['concat', 2]],            # 31
    [[30, 31], 1, Concat, [1]],               # 32
    [-1, 3, C3, [64, False]],                 # 33 (P1/2)

    # Down path (P3->P4->P5->P6)
    [23, 1, Conv, [512, 3, 2]],               # 34
    [[34, 18], 1, Concat, [1]],               # 35
    [-1, 3, C3, [512, False]],                # 36 (P4/16)

    [36, 1, Conv, [1024, 3, 2]],              # 37
    [[37, 13], 1, Concat, [1]],               # 38
    [-1, 3, C3, [1024, False]],               # 39 (P5/32)

    [-1, 1, Conv, [1024, 3, 2]],              # 40
    [-1, 3, C3, [1024, False]],               # 41 (P6/64)

    # Detect heads for P1~P6
    [[33, 28, 23, 36, 39, 41], 1, Detect, [nc, anchors]],
  ]

