# YOLOv5 Modified for Late Fusion (MLPD-style)

nc: 1
depth_multiple: 0.33
width_multiple: 0.25
anchors:
  - [21, 51, 23, 66, 32, 64]       # P1 (/2) - 아주 작은 객체
  - [27, 81, 46, 51, 33, 91]       # P2 (/4) - 작은 객체
  - [31, 113, 44, 89, 38, 114]     # P3 (/8) - 중소형 객체
  - [46, 119, 42, 143, 113, 64]    # P4 (/16) - 중간 객체
  - [51, 155, 64, 145, 60, 195]    # P5 (/32) - 중대형 객체
  - [232, 68, 76, 230, 93, 303]    # P6 (/64) - 매우 큰 객체

# MLPD3 ======================================
backbone:
  [
    # input image: 640 640 6 (W or H, channel)
    [-1, 1, MultiStreamConv, [64, 3, 1]],     # 0 - input stem
    # 640 640 64
    [-1, 1, MultiStreamConv, [64, 3, 2]],     # 1 - P1/2
    # 320 320 64 
    [-1, 1, MultiStreamC3, [64]],             # 2
    # 320 320 64
    [-1, 1, MultiStreamConv, [128, 3, 2]],    # 3 - P2/4
    # 160 160 128
    [-1, 2, MultiStreamC3, [128]],            # 4
    # 160 160 128
    [-1, 1, MultiStreamConv, [256, 3, 2]],    # 5 - P3/8
    # 80 80 256
    [-1, 3, MultiStreamC3, [256]],            # 6
    # 80 80 256
    [-1, 1, MultiStreamConv, [512, 3, 2]],    # 7 - P4/16
    # 40 40 512
    [-1, 3, MultiStreamC3, [512]],            # 8
    # 40 40 512
    [-1, 1, MultiStreamConv, [1024, 3, 2]],   # 9 - P5/32
    # 20 20 1024
    [-1, 3, MultiStreamC3, [1024]],           # 10
    # 20 20 1024
    [-1, 1, Fusion, ['concat', 2]],           # 11
    # 20 20 2048
    [-1, 1, Conv, [1024, 1, 1]],              # 12
    # 20 20 1024
    [-1, 1, SPPF, [1024, 5]],                 # 13
    # 20 20 1024
  ]

head: [
    # Upsample path (P5->P4->P3->P2->P1)
    # 20 20 1024
    [-1, 1, Conv, [512, 1, 1]],               # 14
    # 20 20 512
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 15
    # 40 40 512 (1)
    [8, 1, Fusion, ['concat', 2]],            # 16
    # 40 40 512 (2)
    # (1) + (2)
    [[15, 16], 1, Concat, [1]],               # 17
    # 40 40 1024
    [-1, 3, C3, [512, False]],                # 18 (P4/16)
    # 40 40 512

    [-1, 1, Conv, [256, 1, 1]],               # 19
    # 40 40 256
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 20
    # 80 80 256 (3)
    [6, 1, Fusion, ['concat', 2]],            # 21
    # 80 80 256 (4)
    # (3) + (4)
    [[20, 21], 1, Concat, [1]],               # 22
    # 80 80 512
    [-1, 3, C3, [256, False]],                # 23 (P3/8)
    # 80 80 256

    [-1, 1, Conv, [128, 1, 1]],               # 24
    # 80 80 128
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 25
    # 160 160 128 (5)
    [4, 1, Fusion, ['concat', 2]],            # 26
    # 160 160 128 (6)
    # (5) + (6)
    [[25, 26], 1, Concat, [1]],               # 27
    # 160 160 256
    [-1, 3, C3, [128, False]],                # 28 (P2/4)
    # 160 160 128

    [-1, 1, Conv, [64, 1, 1]],                # 29
    # 160 160 64
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 30
    # 320 320 64 (7)
    [2, 1, Fusion, ['concat', 2]],            # 31
    # 320 320 64 (8)
    # (8) + (9)
    [[30, 31], 1, Concat, [1]],               # 32
    # 320 320 128
    [-1, 3, C3, [64, False]],                 # 33 (P1/2)
    # 320 320 64

    # Down path (P3->P4->P5->P6)
    # 80 80 256
    [23, 1, Conv, [512, 3, 2]],               # 34
    # 40 40 512 (9)
    # (9) + 40 40 512
    [[34, 18], 1, Concat, [1]],               # 35
    # 40 40 1024
    [-1, 3, C3, [512, False]],                # 36 (P4/16)
    # 40 40 512

    [36, 1, Conv, [1024, 3, 2]],              # 37
    # 20 20 1024 (10)
    # (10) + 20 20 1024
    [[37, 13], 1, Concat, [1]],               # 38
    # 20 20 2048
    [-1, 3, C3, [1024, False]],               # 39 (P5/32)
    # 20 20 1024

    [-1, 1, Conv, [1024, 3, 2]],              # 40
    # 10 10 1024
    [-1, 3, C3, [1024, False]],               # 41 (P6/64)
    # 10 10 1024

    # Detect heads for P1~P6
    [[33, 28, 23, 36, 39, 41], 1, Detect, [nc, anchors]],
  ]

