# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  # baseline anchors
  # - [10, 13, 16, 30, 33, 23] # P3/8
  # - [30, 61, 62, 45, 59, 119] # P4/16
  # - [116, 90, 156, 198, 373, 326] # P5/32

  # new anchors by k-means
  # - [24,57, 31,81, 40,113]
  # - [112,64, 50,151, 208,68]
  # - [69,211, 386,62, 88,293]

  # new ahcnors by k-means, same cluster #
  # - [20,50, 22,61, 25,67]
  # - [30,73, 33,89, 39,103]
  # - [43,122, 51,146, 73,221]

  # new anchors: 각 stride끼리 겹치는 크기 존재하게 수정
  - [20,50, 25,67, 30,73]         # stride 8 (small objects)
  - [22,61, 33,89, 43,122]        # stride 16 (medium objects)
  - [39,103, 51,146, 73,221]      # stride 32 (large objects)

  # new anchors: IoU distance based k-means
  # - [21, 49, 22, 64, 25, 78]       # Stride 8 (small)
  # - [32, 80, 36, 105, 44, 134]     # Stride 16 (medium)
  # - [56, 165, 72, 222, 91, 298]    # Stride 32 (large)

  # new anchors: IoU distance based k-means, same Cluster N
  # - [20,52, 24,66, 29,81]     # 작은 객체용 (ID 5, 9, 2)
  # - [31,76, 30,86, 38,116]    # 중간 객체용 (ID 7, 8, 4)
  # - [41,121, 47,151, 74,225]  # 큰 객체용 (ID 6, 3, 1)

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3, [128]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]], # 5-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 7-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 11
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 15

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 19 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 15], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 22 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 25 (P5/32-large)

    [[19, 22, 25], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
