# YOLOv5 Modified for Late Fusion (MLPD-style)

nc: 1
depth_multiple: 0.33
width_multiple: 0.25
anchors: # Anchor2: w>h 무시 안하고 모든 GT로 clustering
  - [21,53, 25,72, 38,57]         # P3/8 (작은 객체)
  - [34,94, 43,124, 83,67]        # P4/16 (중간 객체)
  - [56,166, 216,67, 80,252]      # P5/32 (큰 객체)

# MLPD1 ===================================================
# backbone:
#   # [from, number, module, args]
#   [
#     [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
#     [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
#     [-1, 3, MultiStreamC3, [128]], # 2
#     [-1, 1, MultiStreamConv, [128, 1, 1]], # 3
#     [-1, 1, MultiStreamConv, [128, 3, 2]], # 4-P3/8
#     [-1, 6, MultiStreamC3, [128]], # 5
#     [-1, 1, MultiStreamConv, [256, 3, 2]], # 6-P4/16
#     [-1, 9, MultiStreamC3, [256]], # 7
#     [-1, 1, MultiStreamConv, [512, 3, 2]], # 8-P5/32
#     [-1, 3, MultiStreamC3, [512]], # 9
#     [-1, 1, Fusion, ['concat', 2]], # Fusion, 10
#     [-1, 1, Conv, [1024, 1, 1]], # 11
#     [-1, 1, SPPF, [1024, 5]], # 12
#   ]

# # YOLOv5 v6.0 head
# head: [
#     [-1, 1, Conv, [512, 1, 1]], # 13
#     [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 14
#     [6, 1, Fusion, ['concat', 2]], # 15, backbone P4/16 multistream -> fusion
#     [[-2, 15], 1, Concat, [1]], # 16, cat backbone P4
#     [-1, 3, C3, [512, False]], # 17

#     [-1, 1, Conv, [256, 1, 1]], # 18
#     [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 19
#     [4, 1, Fusion, ['concat', 2]], # 20, backbone P3/8 multistream -> fusion
#     [[-2, 20], 1, Concat, [1]], # 21, cat backbone P3
#     [-1, 3, C3, [256, False]], # 22 (P3/8-small)

#     [-1, 1, Conv, [256, 3, 2]], # 23
#     [[-1, 17], 1, Concat, [1]], # 24, cat head P4
#     [-1, 3, C3, [512, False]], # 25 (P4/16-medium)

#     [-1, 1, Conv, [512, 3, 2]], # 26
#     [[-1, 12], 1, Concat, [1]], # 27, cat head P5
#     [-1, 3, C3, [1024, False]], # 28 (P5/32-large)

#     [[22, 25, 28], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
#  ]

# MLPD2 ======================================
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3, [128]], # 2
    [-1, 1, MultiStreamConv, [128, 1, 1]], # 3
    [-1, 1, MultiStreamConv, [256, 3, 2]], # 4-P3/8
    [-1, 6, MultiStreamC3, [256]], # 5
    [-1, 1, MultiStreamConv, [512, 3, 2]], # 6-P4/16
    [-1, 9, MultiStreamC3, [512]], # 7
    [-1, 1, MultiStreamConv, [1024, 3, 2]], # 8-P5/32
    [-1, 3, MultiStreamC3, [1024]], # 9
    [-1, 1, Fusion, ['concat', 2]], # Fusion, 10
    [-1, 1, Conv, [1024, 1, 1]], # 11
    [-1, 1, SPPF, [1024, 5]], # 12
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]], # 13
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 14
    [6, 1, Fusion, ['concat', 2]], # 15, backbone P4/16 multistream -> fusion
    [-1, 1, Conv, [512, 1, 1]], # 16
    [[14, 16], 1, Concat, [1]], # 17, cat backbone P4
    [-1, 3, C3, [512, False]], # 18

    [-1, 1, Conv, [256, 1, 1]], # 19
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 20
    [4, 1, Fusion, ['concat', 2]], # 21, backbone P3/8 multistream -> fusion
    [-1, 1, Conv, [256, 1, 1]], # 22
    [[20, 22], 1, Concat, [1]], # 23, cat backbone P3
    [-1, 3, C3, [256, False]], # 24 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]], # 25
    [[-1, 18], 1, Concat, [1]], # 26, cat head P4
    [-1, 3, C3, [512, False]], # 27 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]], # 28
    [[-1, 12], 1, Concat, [1]], # 29, cat head P5
    [-1, 3, C3, [1024, False]], # 30 (P5/32-large)

    [[24, 27, 30], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]